# 字段数值类型设置.
categoric_cols <- c(
  "性别", "GCS.8", "神志", "损伤程度", "呼吸机", "气管插管", "插管时间.7", "深静脉置管", 
  "CVC时间.7天", "picc时间.7天", "气管切开", "ICU", "卧床时间.7天", "卧床时间.14天", 
  "高血压", "糖尿病", "肺部疾病", "应激性溃疡", "消化道出血", "骨折", "输血", 
  "术后输血", "是否手术", "受伤至我院.72h", "受伤原因", "死亡", "手术时间.4h", 
  "麻醉时间.6", "术中输血.750", "术中输血", "是否血栓", "血栓部位", "双小腿肌间静脉血栓", 
  "左下肢小腿肌间静脉血栓", "右下肢小腿肌间静脉血栓", "双侧头静脉血栓", "左头静脉", 
  "右头静脉", "双侧肘正中静脉", "左侧肘正中", "右侧肘正中", "双侧贵要静脉", "左贵要静脉", 
  "右贵要静脉", "双侧大隐静脉", "左侧大隐静脉", "左侧大隐静脉小腿段", "右侧大隐静脉", 
  "右侧大隐静脉小腿段", "双侧腋静脉", "左侧腋静脉", "右侧腋静脉", "双侧胫后静脉", 
  "左胫后", "右胫后", "双侧腓静脉", "左侧腓静脉", "右侧腓静脉", "置管周围附壁血栓", 
  "左贵要静脉置管", "右贵要静脉置管", "左锁骨下", "右锁骨下", "右侧股总静脉", 
  "左肱静脉置管", "双侧股总静脉", "左侧股总静脉", "右侧股总静脉", "双侧股浅静脉", 
  "左侧股浅静脉", "右侧股浅静脉", "双侧帼静脉", "左腘", "右腘", "左侧股深静脉", 
  "肺栓塞", "静脉营养治疗", "物理预防", "药物预防")

numeric_cols <- c(
  "年龄", "BMI", "GCS", "插管时间", "CVC", "CVC时间", "PICC", "PICC时间", 
  "住院天数", "红细胞悬液2", "血浆2", "白蛋白", "冷沉淀", "血小板2", 
  "受伤至入我院时间.h.", "手术次数", "术中时间", "麻醉分级", "麻醉时间", 
  "出血量", "红细胞悬液1", "血浆1", "冰冻血浆", "自体血", "去白细胞红细胞悬液", 
  "血小板1", "入院时PT", "入院后3.5天PT", "入院时APTT", "入院后3.5天APTT", 
  "入院时TT.", "入院后3.5天TT", "入院时纤维蛋白原", "入院后3.5天纤维蛋白原", 
  "入院时d.二聚体", "入院后3.5天D.二聚体", "入院时抗凝血酶III", 
  "入院后3.5天抗凝血酶III", "入院时白蛋白", "入院后3.5天白蛋白", 
  "入院时血红蛋白", "入院后3.5天血红蛋白", "入院时血小板计数", "入院后3.5天血小板计数")